In [1]:
import pandas as pd
import sqlite3
tmpdb = sqlite3.connect('tmp4.db')
%load_ext sql
%sql sqlite:///tmp4.db
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%%sql

CREATE TABLE IF NOT EXISTS NOBEL_WIN (
  YEAR INTEGER,
  SUBJECT TEXT,
  WINNER TEXT,
  COUNTRY TEXT,
  CATEGORY TEXT
);

 * sqlite:///tmp4.db
Done.

[]

In [3]:
%%sql

INSERT INTO NOBEL_WIN (YEAR, SUBJECT, WINNER, COUNTRY, CATEGORY) VALUES
  (1970, 'PHYSICS', 'HANNES ALFVEN', 'SWEDEN', 'SCIENTIST'),
  (1970, 'PHYSICS', 'LOUIS NEEL', 'FRANCE', 'SCIENTIST'),
  (1971, 'PHYSICS', 'PAUL', 'FRANCE', 'SCIENTIST'),
  (1971, 'CHEMISTRY', 'HAMILTON', 'SWEDEN', 'LINGUIST'),
  (1972, 'LITERATURE', 'BERNARD KELSON', 'GERMANY', 'ECONOMIST'),
  (1972, 'ECONOMICS', 'JOSEPH', 'RUSSIA', 'ECONOMIST'),
  (1973, 'BIOLOGY', 'PHILIPS', 'USA', 'PRIME MINISTER'),
  (1980, 'BIOLOGY', 'MARTIN', 'USA', 'PRESIDENT'),
  (1981, 'PHYSIOLOGY', 'HANNAH', 'HUNGARY', 'SCIENTIST'),
  (1975, 'PHYSICS', 'PETER', 'CHILE', 'SCIENTIST');

 * sqlite:///tmp4.db
10 rows affected.

[]

In [4]:
%%sql

SELECT * 
FROM NOBEL_WIN 
WHERE SUBJECT NOT LIKE 'P%';

 * sqlite:///tmp4.db
Done.

[(1971, 'CHEMISTRY', 'HAMILTON', 'SWEDEN', 'LINGUIST'),
 (1972, 'LITERATURE', 'BERNARD KELSON', 'GERMANY', 'ECONOMIST'),
 (1972, 'ECONOMICS', 'JOSEPH', 'RUSSIA', 'ECONOMIST'),
 (1973, 'BIOLOGY', 'PHILIPS', 'USA', 'PRIME MINISTER'),
 (1980, 'BIOLOGY', 'MARTIN', 'USA', 'PRESIDENT')]

In [5]:
%%sql

CREATE TABLE IF NOT EXISTS DEPARTMENT (
  EMPLOYEE_ID int,
  NAME TEXT,
  DEPARTMENT_ID int,
  MANAGER_ID int,
  SALARY REAL
);

 * sqlite:///tmp4.db
Done.

[]

In [6]:
%%sql

INSERT INTO DEPARTMENT (EMPLOYEE_ID, NAME, DEPARTMENT_ID, MANAGER_ID, SALARY) VALUES
  (100, 'STEVEN KING', 90, 100, 24000),
  (101, 'NEENA KOCCHAR', 90, 100, 17000),
  (102, 'LEX DEHAAN', 90, 102, 9000),
  (103, 'BRUCE LEE', 60, 103, 4800),
  (104, 'DIANA WILLS', 60, 103, 25000),
  (105, 'VALLI PATOR', 50, 100, 4200),
  (1973, 'LUV HAMI', 60, 102, 5000),
  (106, 'DAVID AUSTIN', 90, 100, 6000);

 * sqlite:///tmp4.db
8 rows affected.

[]

In [7]:
%%sql

SELECT DEPARTMENT_ID AS "Department Code", 
COUNT(*) AS "No of Employees" 
FROM DEPARTMENT
GROUP BY DEPARTMENT_ID;

 * sqlite:///tmp4.db
Done.

[(50, 1), (60, 3), (90, 4)]

In [8]:
%%sql

SELECT DEPARTMENT_ID AS "Department Code", 
SUM(salary) AS "Total Salary" 
FROM DEPARTMENT 
WHERE MANAGER_ID = '103' 
GROUP BY DEPARTMENT_ID;

 * sqlite:///tmp4.db
Done.

[(60, 29800.0)]

In [12]:
%%sql 

SELECT DEPARTMENT_ID AS "Department Code",
COUNT(*) AS "No. of Employees" 
FROM DEPARTMENT 
GROUP BY DEPARTMENT_ID 
HAVING COUNT(*) > 2;

 * sqlite:///tmp4.db
Done.

[(60, 3), (90, 4)]